[
{"article": [], "title": null},
{"article": [], "title": null},
{"article": ["The implication here is that these \"auditors\" could find information that would damage Trump's candidacy for President.  Voters are left to guess at what that might be.  Here are some things to consider:", "Donald Trump's main calling card, his prowess as a hard-charging businessman, is a double-edged sword in the United States.--but also when it comes to his overseas commercial connections. Trump claims that his nearly 200 deals with foreign partners prove he would be a savvy negotiator as President -- but those same deals also suggest a Trump presidency would be dogged by constant conflicts of interest.", "It's not enough for Trump to pledge that he would stash his entire business in a blind trust run by his children.  That's unrealistic: the sprawling Trump Organization, which includes more than 500 individual corporations and licensing arrangements, isn't like a portfolio of stocks that can be handed over to an outside manager. ", "Trump's business website lists real estate and hotel projects in Turkey, Canada, Panama, India, Philippines, Brazil and South Korea. Most have Trump's name plastered all over them, making it impossible to hide or disguise his direct financial interest in policies affecting those countries.", "As investigative reporter Kurt Eichenwald ", ": \"The Trump Organization cannot be placed into a blind trust, an arrangement used by many politicians to prevent them from knowing their financial interests; the Trump family is already aware of who their overseas partners are and could easily learn about any new ones....Any government wanting to seek future influence with President Trump could do so by arranging for a partnership with the Trump Organization, feeding money directly to the family or simply stashing it away inside the company for their use once Trump is out of the White House. \"", "It doesn't help that Trump himself has been vague about how he would handle potential conflicts if elected President. ", ", he offered a confusing word salad about his business empire: \" I would put it in a blind trust. Well, I don't know if it's a blind trust if Ivanka, Don and Eric run it. But — is that a blind trust? I don't know. But I would probably have my children run it with my executives. And I wouldn't ever be involved, because I wouldn't care about anything but our country.\"", "That's a non-starter: Turning his business interests over to his employees and children is the opposite of maintaining the distance that a blind trust would provide. ", "The question grows even trickier when we consider the sketchy nature of many of Trump's partners abroad. ", "As Eichenwald points out, Trump licensed his name to a developer building a massive complex in Istanbul, Turkey, that was so prominent that the nation's President, Recep Tayyip Erdogan, presided at the project's dedication ceremony. ", "But Trump's Turkish partner was an entrepreneur who has since been charged with fuel smuggling, leading Erdogan to call for the Trump name to be removed from the complex in Istanbul.  So a President Trump would have a personal financial interest at odds with the legal wishes of a top American ally in a sensitive part of the world. ", "All of which brings us back to the need to see Trump's tax returns, and the financial details of his many foreign deals.  ", "With fewer than 60 days before we elect a new president, the questions Donald Trump Jr. worried about -- from auditors, voters and the media --are more urgent than ever."], "title": "Why Trump doesn't want you to see his tax returns"},
{"article": ["The US targeted ISIS leader Wael Adel Salman, aka Abu Muhammed Furqan, in a September 7 airstrike, Pentagon press secretary Peter Cook said in a statement issued Friday.", "The strike took out one of the very limited number of ISIS leaders who had \"direct access\" to Abu Bakr Al Baghdadi, the leader of ISIS, according to a US official. The US conducted the strike using a drone, hitting him on a motorcycle just outside a house in Raqqa, ISIS's self-declared capital, the official added.", "Cook called Salman one of the \"most senior leaders\" in ISIS.", "\"He operated as the minister of Information for the terror organization and was a prominent member of its Senior Shura Council -- ISIL's leadership group,\" Cook added, using the government's preferred acronym for the terror group. ", "The US has now killed in the last two months two of the \"very few\" ISIS leaders with direct access to Baghdadi, the official said. Mohammad al-Adnani was killed in Syria in a US airstrike on August 30. He was thought to be in charge of external terror operations. ", "\"Baghdadi's inner circle was already small, and it's getting smaller,\" the official added. Salman is assessed to have been one of the five most-senior officials in ISIS before he and Adnani were killed. ", "Cook said Salman was responsible for overseeing the production of \"terrorist propaganda videos showing torture and executions.\"", "An anti-ISIS group, Raqqa is Being Slaughtered Silently, earlier told CNN's Hamdi Alkhshali that Salman was killed in a drone strike on September 7 in Raqqa, Syria. The group said Salman was responsible for ISIS propaganda and had been chosen to succeed Adnani. ", "Cook called Salman \"a close associate\" of Adnani. ", "Speaking in the UK last week, Secretary of Defense Ash Carter called Adnani \"one of the most lethal leaders within ISIL, who was actively planning to kill our civilians around the world.\"", "\"The removal of ISIL's senior leaders degrades its ability to retain territory, and its ability to plan, finance and direct attacks inside and outside of the region,\" Cook added.  "], "title": "US says it killed new ISIS information minister in drone strike"},
{"article": ["The decision means Democrat Hillary Clinton and Republican Donald Trump will be the only two candidates on the stage on September 26, and Tim Kaine and Mike Pence, their respective running mates, will be the only participants on October 4.", "The candidates needed to make a 15% polling threshold across several major national polls in order to qualify for the debates. The commission determined that the polling averages for the candidates had Clinton at 43%, Trump at 40.4%, Johnson at 8.4% and Stein at 3.2%.", "Johnson has publicly said that being excluded from the debates ", " his campaign.", "Johnson said he wasn't surprised by the decision to \"exclude\" him from the first debate.", "\"There are more polls and more debates, and we plan to be on the debate stage in October,\" Johnson said in a statement.", "Stein's campaign did not immediately respond to a CNN request for comment.", "The commission said it will review the criteria for the second and third debates in the future, but didn't specify in the release when it would make the announcement.", "NBC's Lester Holt will moderate the first debate on September 26. CNN's Anderson Cooper and ABC's Martha Raddatz will lead the second debate, a town hall format, on October 9. Fox's Chris Wallace will moderate the third debate on October 19."], "title": "Johnson, Stein fail to qualify for first debate"},
{"article": ["The new mission, dubbed \"Operation Noble Lance,\" was authorized this week and is now underway, the officials added.  ", "\"US Special Operations Forces have been approved to accompany Turkish and vetted Syrian opposition forces as they continue to clear territory\" from ISIS, Pentagon spokesman Marine Maj. Adrian J.T. Rankine-Galloway said in a statement Friday.", "According to Rankine-Galloway, the US personnel will be conducting the same type of advising, assisting and training missions that the US had been providing to moderate opposition and anti-ISIS Kurdish and Arab fighters like the Syrian Democratic Forces.", "Turkish troops, tanks and Turkish-backed Syria opposition fighters crossed the Syrian-Turkish border in August, seizing the town of Jarabulus from ISIS and pushing south and west in an effort to clear the terror group from its border. The effort was backed by US and coalition airstrikes but not by American ground forces.", "Rankine-Galloway called the area that Turkey was working to secure \"strategically important\" to ISIS.", "A US official had told CNN last month that Special Operations Forces had initially intended to accompany the original Turkish offensive but that the US was still working on approving the proposal when Turkish units pushed across the border.  ", "President Barack Obama has authorized up to 300 Special Operations Forces to be deployed to Syria. It was not clear if the Americans accompanying the Turkish military had been re-assigned from other locations in northern Syria or were part of a new contingent. ", "A video reportedly showing US troops in Syria alongside Turkish army tanks in the northern town of Al Rai recently emerged online. A senior US official said that US troops had entered the town but had since left.", "The latest mission could also help ensure that Turkish troops and their Syrian allies do not come into conflict with other US-backed groups in Syria, such as the Syrian Democratic Forces. The Turkish government considers the Kurdish elements comprising that force to be terrorists, while the US sees the Kurdish fighters as key to efforts to combat ISIS. ", "Clashes between the two groups took place at the start of the Turkish incursion into Syria, and the US has since helped oversee an informal arrangement under which Turkish and Kurdish forces will operate on opposite sides of the Euphrates River."], "title": "US Special Forces join Turkish troops in Syria"},
{"article": ["Qayyarah air base was recaptured from ISIS by Iraqi soldiers backed by US airstrikes ", " and the American forces operating there will mainly provide logistics, supplies and support for the Iraqi offensive on Mosul. The move brings US personnel closer to the battle and ISIS' defensive lines. ", "Asked if US forces advising the Mosul operation faced increased risk, Pentagon press secretary Peter Cook told reporters Thursday that \"the secretary (of defense) has made clear that our forces in Iraq are in harm's way.  Everyone who is serving there is in a dangerous situation.\"", "The air base is also expected to be rebuilt to allow US and coalition aircraft to operate there, since its proximity to Mosul makes it tactically important. ", "\"When the (Iraqi Security Force) is ready to move on in their operations to get after Mosul, we'll be prepared to support that and the airfield will be ready,\" Lt. Gen. Jeffrey Harrigian told reporters Tuesday at the Pentagon.", "\"This is a partnered effort. This is something we're working from both the land component perspective with the Iraqis and clearly ensuring that, as we begin to put some of our airplanes in there in the future, that it's got the capabilities that we need,\" Harrigan added, describing efforts to prepare Qayyarah. ", "The assault on the last major Iraqi city held by ISIS could begin as early as October, according to several US officials.", "The next stage of the effort will involve attempts to seize towns and villages on the southern outskirts of Mosul.", "Iraqi security forces air dropped thousands of leaflets south of the city over the weekend warning citizens in anticipation of a new offensive. ", "\"Protect yourself, don't be human shields for the enemy, leave the town immediately,\" a leaflet shown by the Iraqi military to CNN said. ", "The coalition is stepping up airstrikes along key infiltration routes into Mosul in hopes of keeping the city from being reinforced further by ISIS, a US defense official added.", "The fight for Mosul is expected to be a difficult one with defense officials and intelligence analysts saying that ISIS has dug-in since it first seized the city back in 2014.", "There are 3,000 to 4,500 ISIS fighters in Mosul, according to Operation Inherent Resolve spokesman Col. John Dorrian.", "\"There is still a tough fight ahead against an adaptive enemy that will try to challenge us as we hone in on Mosul,\" Harrigian, the commander of US air forces in the Middle East, said."], "title": "US, Iraqi troops close in on last ISIS-held city"},
{"article": [], "title": null}
]